###############################################################################
# Created by write_sdc
# Sat Dec 31 07:55:32 2022
###############################################################################
current_design dac_con
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 5.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dac_in[0]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dac_in[1]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dac_in[2]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dac_in[3]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dac_in[4]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dac_in[5]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dac_in[6]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dac_in[7]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dac_in[8]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dac_in[9]}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dummy}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst_n}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {test_mode}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {llsb}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {llsb_n}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {lsb[0]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {lsb[1]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {lsb[2]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {lsb[3]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {lsb[4]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {lsb[5]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {lsb_n[0]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {lsb_n[1]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {lsb_n[2]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {lsb_n[3]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {lsb_n[4]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {lsb_n[5]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {msb[0]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {msb[10]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {msb[11]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {msb[12]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {msb[13]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {msb[14]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {msb[15]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {msb[1]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {msb[2]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {msb[3]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {msb[4]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {msb[5]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {msb[6]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {msb[7]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {msb[8]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {msb[9]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {msb_n[0]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {msb_n[10]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {msb_n[11]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {msb_n[12]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {msb_n[13]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {msb_n[14]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {msb_n[15]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {msb_n[1]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {msb_n[2]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {msb_n[3]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {msb_n[4]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {msb_n[5]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {msb_n[6]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {msb_n[7]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {msb_n[8]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {msb_n[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {llsb}]
set_load -pin_load 0.0334 [get_ports {llsb_n}]
set_load -pin_load 0.0334 [get_ports {lsb[5]}]
set_load -pin_load 0.0334 [get_ports {lsb[4]}]
set_load -pin_load 0.0334 [get_ports {lsb[3]}]
set_load -pin_load 0.0334 [get_ports {lsb[2]}]
set_load -pin_load 0.0334 [get_ports {lsb[1]}]
set_load -pin_load 0.0334 [get_ports {lsb[0]}]
set_load -pin_load 0.0334 [get_ports {lsb_n[5]}]
set_load -pin_load 0.0334 [get_ports {lsb_n[4]}]
set_load -pin_load 0.0334 [get_ports {lsb_n[3]}]
set_load -pin_load 0.0334 [get_ports {lsb_n[2]}]
set_load -pin_load 0.0334 [get_ports {lsb_n[1]}]
set_load -pin_load 0.0334 [get_ports {lsb_n[0]}]
set_load -pin_load 0.0334 [get_ports {msb[15]}]
set_load -pin_load 0.0334 [get_ports {msb[14]}]
set_load -pin_load 0.0334 [get_ports {msb[13]}]
set_load -pin_load 0.0334 [get_ports {msb[12]}]
set_load -pin_load 0.0334 [get_ports {msb[11]}]
set_load -pin_load 0.0334 [get_ports {msb[10]}]
set_load -pin_load 0.0334 [get_ports {msb[9]}]
set_load -pin_load 0.0334 [get_ports {msb[8]}]
set_load -pin_load 0.0334 [get_ports {msb[7]}]
set_load -pin_load 0.0334 [get_ports {msb[6]}]
set_load -pin_load 0.0334 [get_ports {msb[5]}]
set_load -pin_load 0.0334 [get_ports {msb[4]}]
set_load -pin_load 0.0334 [get_ports {msb[3]}]
set_load -pin_load 0.0334 [get_ports {msb[2]}]
set_load -pin_load 0.0334 [get_ports {msb[1]}]
set_load -pin_load 0.0334 [get_ports {msb[0]}]
set_load -pin_load 0.0334 [get_ports {msb_n[15]}]
set_load -pin_load 0.0334 [get_ports {msb_n[14]}]
set_load -pin_load 0.0334 [get_ports {msb_n[13]}]
set_load -pin_load 0.0334 [get_ports {msb_n[12]}]
set_load -pin_load 0.0334 [get_ports {msb_n[11]}]
set_load -pin_load 0.0334 [get_ports {msb_n[10]}]
set_load -pin_load 0.0334 [get_ports {msb_n[9]}]
set_load -pin_load 0.0334 [get_ports {msb_n[8]}]
set_load -pin_load 0.0334 [get_ports {msb_n[7]}]
set_load -pin_load 0.0334 [get_ports {msb_n[6]}]
set_load -pin_load 0.0334 [get_ports {msb_n[5]}]
set_load -pin_load 0.0334 [get_ports {msb_n[4]}]
set_load -pin_load 0.0334 [get_ports {msb_n[3]}]
set_load -pin_load 0.0334 [get_ports {msb_n[2]}]
set_load -pin_load 0.0334 [get_ports {msb_n[1]}]
set_load -pin_load 0.0334 [get_ports {msb_n[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dummy}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst_n}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {test_mode}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dac_in[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dac_in[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dac_in[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dac_in[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dac_in[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dac_in[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dac_in[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dac_in[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dac_in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dac_in[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 5.0000 [current_design]
